//FIBFORTH      JOB  USER=GUEST,PASSWORD=PUBL1C,CLASS=A,MSGCLASS=A
//FIBONACI      EXEC FORTHCLG,REGION.FORT=384K
//FORT.SYSLIN   DD   UNIT=SYSDA
//FORT.SYSABEND DD   SYSOUT=A
//FORT.SYSIN    DD   *
C
C     CALCULATE THE FIRST 10 FIBONACCI NUMBERS
C
      I1 = 0
      I2 = 1
C
      DO 20 N = 1, 10
        WRITE(6, 10) N, I2
 10     FORMAT(I3, I4)
        I3 = I1 + I2
        I1 = I2
        I2 = I3
 20   CONTINUE
      STOP
      END
//
